package day11.question.q12;

// 8장 문제 12: PairOfDice.java
// 주사위 쌍을 모델한다

import day10.question2.q5.Dice;

public class PairOfDice
{
   private Dice die1, die2;
   private int value1, value2, total;

   //-----------------------------------------------------------------
   // 두 개의 주사위 객체들을 생성한다. 주사위 숫자들은 1이다.
   //-----------------------------------------------------------------
   public PairOfDice ()
   {
      die1 = new Dice();
      die2 = new Dice();
      value1 = 1;
      value2 = 1;
      total = value1 + value2;
   }

   //-----------------------------------------------------------------
   //  주사위 두 개를 던지고 숫자들의 합을 반환한다
   //-----------------------------------------------------------------
   public int roll ()
   {
      value1 = die1.roll();
      value2 = die2.roll();
      total = value1 + value2;
      return total;
   }

   //-----------------------------------------------------------------
   //  주사위 숫자들의 합을 반환한다
   //-----------------------------------------------------------------
   public int getTotal ()
   {
      return total;
   }

   //-----------------------------------------------------------------
   //  첫번째 주사위 숫자를 반환한다
   //-----------------------------------------------------------------
   public int getDie1 ()
   {
      return value1;
   }

   //-----------------------------------------------------------------
   //  두번째 주사위 숫자를 반환한다
   //-----------------------------------------------------------------
   public int getDie2 ()
   {
      return value2;
   }
}